vrepetenko/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/*
 * Selected frequency limits.
 */
#if (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE1) || \
    defined(__DOXYGEN__)
#define STM32_HSECLK_MIN                    STM32_VOS1_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS1_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS1_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS1_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS1_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS1_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS1_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS1_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS1_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS1_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS1_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS1_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS1_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS1_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS1_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS1_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS1_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS1_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS1_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS1_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS1_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS1_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS1_SDMMCCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS1_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS1_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS1_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS1_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS1_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS1_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS1_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS1_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS1_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS1_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS1_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS1_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS1_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS1_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS1_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS1_FLASH_15WS_MAX
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE2)
#define STM32_HSECLK_MIN                    STM32_VOS2_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS2_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS2_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS2_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS2_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS2_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS2_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS2_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS2_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS2_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS2_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS2_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS2_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS2_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS2_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS2_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS2_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS2_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS2_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS2_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS2_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS2_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS2_SDMMCCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS2_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS2_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS2_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS2_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS2_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS2_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS2_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS2_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS2_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS2_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS2_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS2_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS2_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS2_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS2_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS2_FLASH_15WS_MAX
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE3)
#define STM32_HSECLK_MIN                    STM32_VOS3_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS3_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS3_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS3_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS3_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS3_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS3_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS3_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS3_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS3_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS3_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS3_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS3_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS3_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS3_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS3_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS3_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS3_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS3_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS3_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS3_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS3_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS3_SDMMCCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS3_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS3_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS3_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS3_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS3_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS3_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS3_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS3_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS3_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS3_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS3_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS3_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS3_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS3_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS3_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS3_FLASH_15WS_MAX
#elif (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE4)
#define STM32_HSECLK_MIN                    STM32_VOS4_HSECLK_MIN
#define STM32_HSECLK_MAX                    STM32_VOS4_HSECLK_MAX
#define STM32_LSECLK_MIN                    STM32_VOS4_LSECLK_MIN
#define STM32_LSECLK_MAX                    STM32_VOS4_LSECLK_MAX
#define STM32_PLLIN_MIN                     STM32_VOS4_PLLIN_MIN
#define STM32_PLLIN_MAX                     STM32_VOS4_PLLIN_MAX
#define STM32_PLLVCO_MIN                    STM32_VOS4_PLLVCO_MIN
#define STM32_PLLVCO_MAX                    STM32_VOS4_PLLVCO_MAX
#define STM32_PLLP_MIN                      STM32_VOS4_PLLP_MIN
#define STM32_PLLP_MAX                      STM32_VOS4_PLLP_MAX
#define STM32_PLLQ_MIN                      STM32_VOS4_PLLQ_MIN
#define STM32_PLLQ_MAX                      STM32_VOS4_PLLQ_MAX
#define STM32_PLLR_MIN                      STM32_VOS4_PLLR_MIN
#define STM32_PLLR_MAX                      STM32_VOS4_PLLR_MAX
#define STM32_SYSCLK_MAX                    STM32_VOS4_SYSCLK_MAX
#define STM32_HCLK_MAX                      STM32_VOS4_HCLK_MAX
#define STM32_PCLK1_MAX                     STM32_VOS4_PCLK1_MAX
#define STM32_PCLK2_MAX                     STM32_VOS4_PCLK2_MAX
#define STM32_PCLK3_MAX                     STM32_VOS4_PCLK3_MAX
#define STM32_ADCCLK_MAX                    STM32_VOS4_ADCCLK_MAX
#define STM32_USBCLK_MIN                    STM32_VOS4_USBCLK_MIN
#define STM32_USBCLK_MAX                    STM32_VOS4_USBCLK_MAX
#define STM32_SDMMCCLK_MAX                  STM32_VOS4_SDMMCCLK_MAX
#define STM32_FLASH_0WS_MAX                 STM32_VOS4_FLASH_0WS_MAX
#define STM32_FLASH_1WS_MAX                 STM32_VOS4_FLASH_1WS_MAX
#define STM32_FLASH_2WS_MAX                 STM32_VOS4_FLASH_2WS_MAX
#define STM32_FLASH_3WS_MAX                 STM32_VOS4_FLASH_3WS_MAX
#define STM32_FLASH_4WS_MAX                 STM32_VOS4_FLASH_4WS_MAX
#define STM32_FLASH_5WS_MAX                 STM32_VOS4_FLASH_5WS_MAX
#define STM32_FLASH_6WS_MAX                 STM32_VOS4_FLASH_6WS_MAX
#define STM32_FLASH_7WS_MAX                 STM32_VOS4_FLASH_7WS_MAX
#define STM32_FLASH_8WS_MAX                 STM32_VOS4_FLASH_8WS_MAX
#define STM32_FLASH_9WS_MAX                 STM32_VOS4_FLASH_9WS_MAX
#define STM32_FLASH_10WS_MAX                STM32_VOS4_FLASH_10WS_MAX
#define STM32_FLASH_11WS_MAX                STM32_VOS4_FLASH_11WS_MAX
#define STM32_FLASH_12WS_MAX                STM32_VOS4_FLASH_12WS_MAX
#define STM32_FLASH_13WS_MAX                STM32_VOS4_FLASH_13WS_MAX
#define STM32_FLASH_14WS_MAX                STM32_VOS4_FLASH_14WS_MAX
#define STM32_FLASH_15WS_MAX                STM32_VOS4_FLASH_15WS_MAX
#else
  #error "unable to select clock frequency limits"
#endif

/**
 * @name    Sink demand states
 * @{
 */
/**
 * @brief   PLL1P_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL1P_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1P_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL1P_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL1Q_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL1Q_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1Q_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL1Q_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL1R_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL1R_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1R_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL1R_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL2P_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL2P_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2P_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL2P_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL2Q_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL2Q_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2Q_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL2Q_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL2R_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL2R_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2R_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL2R_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL3P_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL3P_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3P_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL3P_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL3Q_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL3Q_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3Q_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL3Q_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   PLL3R_REQUIRED sink demand state.
 */
#if (STM32_CFG_PLL3R_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3R_REQUIRED_DEMANDED     TRUE
#else
  #define STM32_PLL3R_REQUIRED_DEMANDED     FALSE
#endif

/**
 * @brief   USART1_SERIAL_DRIVER sink demand state.
 */
#if ((HAL_USE_SERIAL == TRUE) && (STM32_SERIAL_USE_USART1 == TRUE)) ||      \
    defined(__DOXYGEN__)
  #define STM32_USART1_SERIAL_DRIVER_DEMANDED TRUE
#else
  #define STM32_USART1_SERIAL_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   USART1_SIO_DRIVER sink demand state.
 */
#if ((HAL_USE_SIO == TRUE) && (STM32_SIO_USE_USART1 == TRUE)) ||            \
    defined(__DOXYGEN__)
  #define STM32_USART1_SIO_DRIVER_DEMANDED  TRUE
#else
  #define STM32_USART1_SIO_DRIVER_DEMANDED  FALSE
#endif

/**
 * @brief   USART2_SERIAL_DRIVER sink demand state.
 */
#if ((HAL_USE_SERIAL == TRUE) && (STM32_SERIAL_USE_USART2 == TRUE)) ||      \
    defined(__DOXYGEN__)
  #define STM32_USART2_SERIAL_DRIVER_DEMANDED TRUE
#else
  #define STM32_USART2_SERIAL_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   USART2_SIO_DRIVER sink demand state.
 */
#if ((HAL_USE_SIO == TRUE) && (STM32_SIO_USE_USART2 == TRUE)) ||            \
    defined(__DOXYGEN__)
  #define STM32_USART2_SIO_DRIVER_DEMANDED  TRUE
#else
  #define STM32_USART2_SIO_DRIVER_DEMANDED  FALSE
#endif

/**
 * @brief   USART3_SERIAL_DRIVER sink demand state.
 */
#if ((HAL_USE_SERIAL == TRUE) && (STM32_SERIAL_USE_USART3 == TRUE)) ||      \
    defined(__DOXYGEN__)
  #define STM32_USART3_SERIAL_DRIVER_DEMANDED TRUE
#else
  #define STM32_USART3_SERIAL_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   USART3_SIO_DRIVER sink demand state.
 */
#if ((HAL_USE_SIO == TRUE) && (STM32_SIO_USE_USART3 == TRUE)) ||            \
    defined(__DOXYGEN__)
  #define STM32_USART3_SIO_DRIVER_DEMANDED  TRUE
#else
  #define STM32_USART3_SIO_DRIVER_DEMANDED  FALSE
#endif

/**
 * @brief   UART4_SERIAL_DRIVER sink demand state.
 */
#if ((HAL_USE_SERIAL == TRUE) && (STM32_SERIAL_USE_UART4 == TRUE)) ||       \
    defined(__DOXYGEN__)
  #define STM32_UART4_SERIAL_DRIVER_DEMANDED TRUE
#else
  #define STM32_UART4_SERIAL_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   UART4_SIO_DRIVER sink demand state.
 */
#if ((HAL_USE_SIO == TRUE) && (STM32_SIO_USE_UART4 == TRUE)) ||             \
    defined(__DOXYGEN__)
  #define STM32_UART4_SIO_DRIVER_DEMANDED   TRUE
#else
  #define STM32_UART4_SIO_DRIVER_DEMANDED   FALSE
#endif

/**
 * @brief   UART5_SERIAL_DRIVER sink demand state.
 */
#if ((HAL_USE_SERIAL == TRUE) && (STM32_SERIAL_USE_UART5 == TRUE)) ||       \
    defined(__DOXYGEN__)
  #define STM32_UART5_SERIAL_DRIVER_DEMANDED TRUE
#else
  #define STM32_UART5_SERIAL_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   UART5_SIO_DRIVER sink demand state.
 */
#if ((HAL_USE_SIO == TRUE) && (STM32_SIO_USE_UART5 == TRUE)) ||             \
    defined(__DOXYGEN__)
  #define STM32_UART5_SIO_DRIVER_DEMANDED   TRUE
#else
  #define STM32_UART5_SIO_DRIVER_DEMANDED   FALSE
#endif

/**
 * @brief   LPUART1_SERIAL_DRIVER sink demand state.
 */
#if ((HAL_USE_SERIAL == TRUE) && (STM32_SERIAL_USE_LPUART1 == TRUE)) ||     \
    defined(__DOXYGEN__)
  #define STM32_LPUART1_SERIAL_DRIVER_DEMANDED TRUE
#else
  #define STM32_LPUART1_SERIAL_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   LPUART1_SIO_DRIVER sink demand state.
 */
#if ((HAL_USE_SIO == TRUE) && (STM32_SIO_USE_LPUART1 == TRUE)) ||           \
    defined(__DOXYGEN__)
  #define STM32_LPUART1_SIO_DRIVER_DEMANDED TRUE
#else
  #define STM32_LPUART1_SIO_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   I2C1_DRIVER sink demand state.
 */
#if ((HAL_USE_I2C == TRUE) && (STM32_I2C_USE_I2C1 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_I2C1_DRIVER_DEMANDED        TRUE
#else
  #define STM32_I2C1_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   I2C2_DRIVER sink demand state.
 */
#if ((HAL_USE_I2C == TRUE) && (STM32_I2C_USE_I2C2 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_I2C2_DRIVER_DEMANDED        TRUE
#else
  #define STM32_I2C2_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   I2C3_DRIVER sink demand state.
 */
#if ((HAL_USE_I2C == TRUE) && (STM32_I2C_USE_I2C3 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_I2C3_DRIVER_DEMANDED        TRUE
#else
  #define STM32_I2C3_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   I2C4_DRIVER sink demand state.
 */
#if ((HAL_USE_I2C == TRUE) && (STM32_I2C_USE_I2C4 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_I2C4_DRIVER_DEMANDED        TRUE
#else
  #define STM32_I2C4_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   SPI1_DRIVER sink demand state.
 */
#if ((HAL_USE_SPI == TRUE) && (STM32_SPI_USE_SPI1 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_SPI1_DRIVER_DEMANDED        TRUE
#else
  #define STM32_SPI1_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   SPI2_DRIVER sink demand state.
 */
#if ((HAL_USE_SPI == TRUE) && (STM32_SPI_USE_SPI2 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_SPI2_DRIVER_DEMANDED        TRUE
#else
  #define STM32_SPI2_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   SPI3_DRIVER sink demand state.
 */
#if ((HAL_USE_SPI == TRUE) && (STM32_SPI_USE_SPI3 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_SPI3_DRIVER_DEMANDED        TRUE
#else
  #define STM32_SPI3_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   FDCAN1_DRIVER sink demand state.
 */
#if ((HAL_USE_CAN == TRUE) && (STM32_CAN_USE_FDCAN1 == TRUE)) ||            \
    defined(__DOXYGEN__)
  #define STM32_FDCAN1_DRIVER_DEMANDED      TRUE
#else
  #define STM32_FDCAN1_DRIVER_DEMANDED      FALSE
#endif

/**
 * @brief   SYSTICK_DRIVER sink demand state.
 */
#if (OSAL_ST_MODE == OSAL_ST_MODE_PERIODIC) || defined(__DOXYGEN__)
  #define STM32_SYSTICK_DRIVER_DEMANDED     TRUE
#else
  #define STM32_SYSTICK_DRIVER_DEMANDED     FALSE
#endif

/**
 * @brief   TIMICSEL_HSI16_SOURCE sink demand state.
 */
#if (STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_TIMICSEL_HSI16_SOURCE_DEMANDED TRUE
#else
  #define STM32_TIMICSEL_HSI16_SOURCE_DEMANDED FALSE
#endif

/**
 * @brief   TIMICSEL_MSIS_SOURCE sink demand state.
 */
#if (STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_TIMICSEL_MSIS_SOURCE_DEMANDED TRUE
#else
  #define STM32_TIMICSEL_MSIS_SOURCE_DEMANDED FALSE
#endif

/**
 * @brief   TIMICSEL_MSIK_SOURCE sink demand state.
 */
#if (STM32_CFG_TIMICSEL != RCC_CCIPR1_TIMICSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_TIMICSEL_MSIK_SOURCE_DEMANDED TRUE
#else
  #define STM32_TIMICSEL_MSIK_SOURCE_DEMANDED FALSE
#endif

/**
 * @brief   USB1_DRIVER sink demand state.
 */
#if ((HAL_USE_USB == TRUE) && (STM32_USB_USE_USB1 == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_USB1_DRIVER_DEMANDED        TRUE
#else
  #define STM32_USB1_DRIVER_DEMANDED        FALSE
#endif

/**
 * @brief   SDMMC1_DRIVER sink demand state.
 */
#if ((HAL_USE_SDC == TRUE) && (STM32_SDC_USE_SDMMC1 == TRUE)) ||            \
    defined(__DOXYGEN__)
  #define STM32_SDMMC1_DRIVER_DEMANDED      TRUE
#else
  #define STM32_SDMMC1_DRIVER_DEMANDED      FALSE
#endif

/**
 * @brief   SDMMC2_DRIVER sink demand state.
 */
#if ((HAL_USE_SDC == TRUE) && (STM32_SDC_USE_SDMMC2 == TRUE)) ||            \
    defined(__DOXYGEN__)
  #define STM32_SDMMC2_DRIVER_DEMANDED      TRUE
#else
  #define STM32_SDMMC2_DRIVER_DEMANDED      FALSE
#endif

/**
 * @brief   OCTOSPI1_WSPI_DRIVER sink demand state.
 */
#if (defined(STM32_WSPI_USE_OCTOSPI1) && (HAL_USE_WSPI == TRUE) &&          \
     (STM32_WSPI_USE_OCTOSPI1 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_OCTOSPI1_WSPI_DRIVER_DEMANDED TRUE
#else
  #define STM32_OCTOSPI1_WSPI_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   OCTOSPI2_WSPI_DRIVER sink demand state.
 */
#if (defined(STM32_WSPI_USE_OCTOSPI2) && (HAL_USE_WSPI == TRUE) &&          \
     (STM32_WSPI_USE_OCTOSPI2 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_OCTOSPI2_WSPI_DRIVER_DEMANDED TRUE
#else
  #define STM32_OCTOSPI2_WSPI_DRIVER_DEMANDED FALSE
#endif

/**
 * @brief   RNG_DRIVER sink demand state.
 */
#if ((HAL_USE_TRNG == TRUE) && (STM32_TRNG_USE_RNG1 == TRUE)) ||            \
    defined(__DOXYGEN__)
  #define STM32_RNG_DRIVER_DEMANDED         TRUE
#else
  #define STM32_RNG_DRIVER_DEMANDED         FALSE
#endif

/**
 * @brief   SAI1_I2S_DRIVER sink demand state.
 */
#if (defined(STM32_I2S_USE_SAI1) && (HAL_USE_I2S == TRUE) &&                \
     (STM32_I2S_USE_SAI1 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_SAI1_I2S_DRIVER_DEMANDED    TRUE
#else
  #define STM32_SAI1_I2S_DRIVER_DEMANDED    FALSE
#endif

/**
 * @brief   SAI2_I2S_DRIVER sink demand state.
 */
#if (defined(STM32_I2S_USE_SAI2) && (HAL_USE_I2S == TRUE) &&                \
     (STM32_I2S_USE_SAI2 == TRUE)) || defined(__DOXYGEN__)
  #define STM32_SAI2_I2S_DRIVER_DEMANDED    TRUE
#else
  #define STM32_SAI2_I2S_DRIVER_DEMANDED    FALSE
#endif

/**
 * @brief   MDF1_REQUIRED sink demand state.
 */
#if (STM32_CFG_MDF1_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_MDF1_REQUIRED_DEMANDED      TRUE
#else
  #define STM32_MDF1_REQUIRED_DEMANDED      FALSE
#endif

/**
 * @brief   ADF1_REQUIRED sink demand state.
 */
#if (STM32_CFG_ADF1_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_ADF1_REQUIRED_DEMANDED      TRUE
#else
  #define STM32_ADF1_REQUIRED_DEMANDED      FALSE
#endif

/**
 * @brief   ADCDAC_ADC_DRIVER sink demand state.
 */
#if ((HAL_USE_ADC == TRUE) && ((STM32_ADC_USE_ADC1 == TRUE) ||              \
      (defined(STM32_ADC_USE_ADC4) && (STM32_ADC_USE_ADC4 == TRUE)))) ||    \
    defined(__DOXYGEN__)
  #define STM32_ADCDAC_ADC_DRIVER_DEMANDED  TRUE
#else
  #define STM32_ADCDAC_ADC_DRIVER_DEMANDED  FALSE
#endif

/**
 * @brief   ADCDAC_DAC_DRIVER sink demand state.
 */
#if ((HAL_USE_DAC == TRUE) && ((STM32_DAC_USE_DAC1_CH1 == TRUE) ||          \
      (STM32_DAC_USE_DAC1_CH2 == TRUE))) || defined(__DOXYGEN__)
  #define STM32_ADCDAC_DAC_DRIVER_DEMANDED  TRUE
#else
  #define STM32_ADCDAC_DAC_DRIVER_DEMANDED  FALSE
#endif

/**
 * @brief   DAC1SH_REQUIRED sink demand state.
 */
#if (STM32_CFG_DAC1SH_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_DAC1SH_REQUIRED_DEMANDED    TRUE
#else
  #define STM32_DAC1SH_REQUIRED_DEMANDED    FALSE
#endif

/**
 * @brief   LPTIM1_REQUIRED sink demand state.
 */
#if (STM32_CFG_LPTIM1_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LPTIM1_REQUIRED_DEMANDED    TRUE
#else
  #define STM32_LPTIM1_REQUIRED_DEMANDED    FALSE
#endif

/**
 * @brief   LPTIM2_REQUIRED sink demand state.
 */
#if (STM32_CFG_LPTIM2_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LPTIM2_REQUIRED_DEMANDED    TRUE
#else
  #define STM32_LPTIM2_REQUIRED_DEMANDED    FALSE
#endif

/**
 * @brief   LPTIM34_REQUIRED sink demand state.
 */
#if (STM32_CFG_LPTIM34_REQUIRED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LPTIM34_REQUIRED_DEMANDED   TRUE
#else
  #define STM32_LPTIM34_REQUIRED_DEMANDED   FALSE
#endif

/**
 * @brief   IWDG_DRIVER sink demand state.
 */
#if ((HAL_USE_WDG == TRUE) && (STM32_WDG_USE_IWDG == TRUE)) ||              \
    defined(__DOXYGEN__)
  #define STM32_IWDG_DRIVER_DEMANDED        TRUE
#else
  #define STM32_IWDG_DRIVER_DEMANDED        FALSE
#endif
/** @} */

