vrepetenko/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_PLL2R_ENABLED != TRUE) || (STM32_PLL2R_FREQ >= STM32_PLLR_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL2R_FREQ below minimum frequency"
#endif

#if !((STM32_PLL2R_ENABLED != TRUE) || (STM32_PLL2R_FREQ <= STM32_PLLR_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL2R_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL3IN clock point. -----------------------*/

/**
 * @brief   PLL3IN clock register bits.
 */
#if (STM32_PLL3IN_ENABLED == FALSE)
  #define STM32_PLL3IN_BITS                 RCC_PLL3CFGR_PLL3SRC_NOCLOCK
#elif (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_NOCLOCK) ||             \
      defined(__DOXYGEN__)
  #if (STM32_PLL3IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL3IN_BITS               RCC_PLL3CFGR_PLL3SRC_NOCLOCK
  #else
    #define STM32_PLL3IN_BITS               0U
  #endif
#elif (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_MSIS)
  #if (STM32_PLL3IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL3IN_BITS               RCC_PLL3CFGR_PLL3SRC_MSIS
  #else
    #define STM32_PLL3IN_BITS               0U
  #endif
#elif (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_HSI16)
  #if (STM32_PLL3IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL3IN_BITS               RCC_PLL3CFGR_PLL3SRC_HSI16
  #else
    #define STM32_PLL3IN_BITS               0U
  #endif
#elif (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_HSE)
  #if (STM32_PLL3IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL3IN_BITS               RCC_PLL3CFGR_PLL3SRC_HSE
  #else
    #define STM32_PLL3IN_BITS               0U
  #endif
#else
  #error "invalid STM32_CFG_PLL3IN_SEL value specified"
#endif

/**
 * @brief   PLL3 input clock point.
 */
#if ((STM32_PLL3IN_ENABLED == TRUE) && \
     (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_PLL3IN_FREQ                 STM32_NONE_FREQ
  #define STM32_PLL3IN_CLOCK                STM32_NONE_CLOCK
#elif (STM32_PLL3IN_ENABLED == TRUE) && \
      (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_MSIS)
  #define STM32_PLL3IN_FREQ                 STM32_MSIS_FREQ
  #define STM32_PLL3IN_CLOCK                STM32_MSIS_CLOCK
#elif (STM32_PLL3IN_ENABLED == TRUE) && \
      (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_HSI16)
  #define STM32_PLL3IN_FREQ                 STM32_HSI16_FREQ
  #define STM32_PLL3IN_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_PLL3IN_ENABLED == TRUE) && \
      (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_HSE)
  #define STM32_PLL3IN_FREQ                 STM32_HSE_FREQ
  #define STM32_PLL3IN_CLOCK                STM32_HSE_CLOCK
#else
  #define STM32_PLL3IN_FREQ                 0U
  #define STM32_PLL3IN_CLOCK                0U
#endif

/* --- Macros and checks for the PLL3REF clock point. ----------------------*/

#if !((STM32_CFG_PLL3REF_VALUE >= 1) && (STM32_CFG_PLL3REF_VALUE <= 16)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3REF_VALUE value specified"
#endif

/**
 * @brief   PLL3REF clock register bits.
 */
#if (STM32_PLL3REF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3REF_BITS                ((STM32_CFG_PLL3REF_VALUE - 1U) << RCC_PLL3CFGR_PLL3M_Pos) | (((STM32_PLL3REF_FREQ) > 8000000U) ? RCC_PLL3CFGR_PLL3RGE_8TO16 : \
                                             RCC_PLL3CFGR_PLL3RGE_4TO8)
#else
  #define STM32_PLL3REF_BITS                0U
#endif

/**
 * @brief   PLL3 reference clock point.
 */
#if (STM32_PLL3REF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3REF_FREQ                (STM32_PLL3IN_FREQ /            \
                                             STM32_CFG_PLL3REF_VALUE)
  #define STM32_PLL3REF_CLOCK               (STM32_PLL3IN_CLOCK /           \
                                             STM32_CFG_PLL3REF_VALUE)
#else
  #define STM32_PLL3REF_FREQ                0U
  #define STM32_PLL3REF_CLOCK               0U
#endif

#if !((STM32_PLL3REF_ENABLED != TRUE) ||                                    \
     (STM32_PLL3REF_FREQ >= STM32_PLLIN_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_PLL3REF_FREQ below minimum frequency"
#endif

#if !((STM32_PLL3REF_ENABLED != TRUE) ||                                    \
     (STM32_PLL3REF_FREQ <= STM32_PLLIN_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_PLL3REF_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL3VCO clock point. ----------------------*/

#if !((STM32_CFG_PLL3VCO_VALUE >= 4) && (STM32_CFG_PLL3VCO_VALUE <= 136)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3VCO_VALUE value specified"
#endif

/**
 * @brief   PLL3VCO clock register bits.
 */
#if (STM32_PLL3VCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3VCO_BITS                ((STM32_CFG_PLL3VCO_VALUE -     \
                                              1U) << RCC_PLL3DIVR_PLL3N_Pos)
#else
  #define STM32_PLL3VCO_BITS                0U
#endif

/**
 * @brief   PLL3 VCO clock point.
 */
#if (STM32_PLL3VCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3VCO_FREQ                (STM32_PLL3REF_FREQ *           \
                                             STM32_CFG_PLL3VCO_VALUE)
  #define STM32_PLL3VCO_CLOCK               (STM32_PLL3REF_CLOCK *          \
                                             STM32_CFG_PLL3VCO_VALUE)
#else
  #define STM32_PLL3VCO_FREQ                0U
  #define STM32_PLL3VCO_CLOCK               0U
#endif

#if !((STM32_PLL3VCO_ENABLED != TRUE) ||                                    \
     (STM32_PLL3VCO_FREQ >= STM32_PLLVCO_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_PLL3VCO_FREQ below minimum frequency"
#endif

#if !((STM32_PLL3VCO_ENABLED != TRUE) ||                                    \
     (STM32_PLL3VCO_FREQ <= STM32_PLLVCO_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_PLL3VCO_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL3P clock point. ------------------------*/

#if !((STM32_CFG_PLL3P_VALUE >= 1) && (STM32_CFG_PLL3P_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3P_VALUE value specified"
#endif

/**
 * @brief   PLL3P clock register bits.
 */
#if (STM32_PLL3P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3P_BITS                  ((STM32_CFG_PLL3P_VALUE -       \
                                              1U) << RCC_PLL3DIVR_PLL3P_Pos)
#else
  #define STM32_PLL3P_BITS                  0U
#endif

/**
 * @brief   PLL3 P output clock point.
 */
#if (STM32_PLL3P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL3P_FREQ                  (STM32_PLL3VCO_FREQ /           \
                                             STM32_CFG_PLL3P_VALUE)
#else
  #define STM32_PLL3P_FREQ                  0U
#endif
#define STM32_PLL3P_CLOCK                   hal_lld_get_clock_point(CLK_PLL3P)

#if !((STM32_PLL3P_ENABLED != TRUE) || (STM32_PLL3P_FREQ >= STM32_PLLP_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3P_FREQ below minimum frequency"
#endif

#if !((STM32_PLL3P_ENABLED != TRUE) || (STM32_PLL3P_FREQ <= STM32_PLLP_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL3P_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL3Q clock point. ------------------------*/

