vrepetenko/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the TIM17IC clock point. ----------------------*/

/**
 * @brief   TIM17IC clock register bits.
 */
#define STM32_TIM17IC_BITS                  0U

/**
 * @brief   TIM17 internal capture clock point.
 */
#if (STM32_TIM17IC_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_TIM17IC_FREQ                0U
  #define STM32_TIM17IC_CLOCK               0U
#elif (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) || \
    defined(__DOXYGEN__)
  #define STM32_TIM17IC_FREQ                0U
  #define STM32_TIM17IC_CLOCK               0U
#elif ((STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) || (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4))
  #define STM32_TIM17IC_FREQ                (STM32_MSIS_FREQ / 1024U)
  #define STM32_TIM17IC_CLOCK               (STM32_MSIS_FREQ / 1024U)
#else
  #define STM32_TIM17IC_FREQ                (STM32_MSIK_FREQ / 1024U)
  #define STM32_TIM17IC_CLOCK               (STM32_MSIK_FREQ / 1024U)
#endif

/* --- Macros and checks for the LPTIM2IC clock point. ---------------------*/

/**
 * @brief   LPTIM2IC clock register bits.
 */
#define STM32_LPTIM2IC_BITS                 0U

/**
 * @brief   LPTIM2 internal capture clock point.
 */
#if (STM32_LPTIM2IC_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_LPTIM2IC_FREQ               0U
  #define STM32_LPTIM2IC_CLOCK              0U
#elif (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) || \
    defined(__DOXYGEN__)
  #define STM32_LPTIM2IC_FREQ               0U
  #define STM32_LPTIM2IC_CLOCK              0U
#elif ((STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) || (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4))
  #define STM32_LPTIM2IC_FREQ               (STM32_MSIS_FREQ / 4U)
  #define STM32_LPTIM2IC_CLOCK              (STM32_MSIS_FREQ / 4U)
#else
  #define STM32_LPTIM2IC_FREQ               (STM32_MSIK_FREQ / 4U)
  #define STM32_LPTIM2IC_CLOCK              (STM32_MSIK_FREQ / 4U)
#endif

/* --- Macros and checks for the ICLK clock point. -------------------------*/

/**
 * @brief   ICLK clock register bits.
 */
#if (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSI48) || defined(__DOXYGEN__)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_HSI48
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#elif (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_PLL2Q)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_PLL2Q
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#elif (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_PLL1Q)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_PLL1Q
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#elif (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_MSIK)
  #if (STM32_ICLK_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_ICLK_BITS                 RCC_CCIPR1_ICLKSEL_MSIK
  #else
    #define STM32_ICLK_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_ICLK_SEL value specified"
#endif

/**
 * @brief   ICLK 48 MHz clock point.
 */
#if ((STM32_ICLK_ENABLED == TRUE) && \
     (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSI48)) || \
    defined(__DOXYGEN__)
  #define STM32_ICLK_FREQ                   STM32_HSI48_FREQ
  #define STM32_ICLK_CLOCK                  STM32_HSI48_CLOCK
#elif (STM32_ICLK_ENABLED == TRUE) && \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_PLL2Q)
  #define STM32_ICLK_FREQ                   STM32_PLL2Q_FREQ
  #define STM32_ICLK_CLOCK                  STM32_PLL2Q_CLOCK
#elif (STM32_ICLK_ENABLED == TRUE) && \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_PLL1Q)
  #define STM32_ICLK_FREQ                   STM32_PLL1Q_FREQ
  #define STM32_ICLK_CLOCK                  STM32_PLL1Q_CLOCK
#elif (STM32_ICLK_ENABLED == TRUE) && \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_MSIK)
  #define STM32_ICLK_FREQ                   STM32_MSIK_FREQ
  #define STM32_ICLK_CLOCK                  STM32_MSIK_CLOCK
#else
  #define STM32_ICLK_FREQ                   0U
  #define STM32_ICLK_CLOCK                  0U
#endif

/* --- Macros and checks for the USB clock point. --------------------------*/

/**
 * @brief   USB clock register bits.
 */
#define STM32_USB_BITS                      0U

/**
 * @brief   USB clock point.
 */
#if (STM32_USB_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_USB_FREQ                    STM32_ICLK_FREQ
  #define STM32_USB_CLOCK                   STM32_ICLK_CLOCK
#else
  #define STM32_USB_FREQ                    0U
  #define STM32_USB_CLOCK                   0U
#endif

/* --- Macros and checks for the SDMMC clock point. ------------------------*/

/**
 * @brief   SDMMC clock register bits.
 */
#if (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK) || defined(__DOXYGEN__)
  #if (STM32_SDMMC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SDMMC_BITS                RCC_CCIPR2_SDMMCSEL_ICLK
  #else
    #define STM32_SDMMC_BITS                0U
  #endif
#elif (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_PLL1P)
  #if (STM32_SDMMC_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SDMMC_BITS                RCC_CCIPR2_SDMMCSEL_PLL1P
  #else
    #define STM32_SDMMC_BITS                0U
  #endif
#else
  #error "invalid STM32_CFG_SDMMC_SEL value specified"
#endif

/**
 * @brief   SDMMC clock point.
 */
#if ((STM32_SDMMC_ENABLED == TRUE) && \
     (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK)) || \
    defined(__DOXYGEN__)
  #define STM32_SDMMC_FREQ                  STM32_ICLK_FREQ
  #define STM32_SDMMC_CLOCK                 STM32_ICLK_CLOCK
#elif (STM32_SDMMC_ENABLED == TRUE) && \
      (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_PLL1P)
  #define STM32_SDMMC_FREQ                  STM32_PLL1P_FREQ
  #define STM32_SDMMC_CLOCK                 STM32_PLL1P_CLOCK
#else
  #define STM32_SDMMC_FREQ                  0U
  #define STM32_SDMMC_CLOCK                 0U
#endif

#if !(!((STM32_SDMMC_ENABLED == TRUE) &&                                    \
      (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK)) ||                 \
     (STM32_ICLK_FREQ <= STM32_SDMMCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SDMMC_FREQ above maximum frequency"
#endif

#if !(!((STM32_SDMMC_ENABLED == TRUE) &&                                    \
      (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_PLL1P)) ||                \
     (STM32_PLL1P_FREQ <= STM32_SDMMCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_SDMMC_FREQ above maximum frequency"
#endif

