vrepetenko/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the IWDG clock point. -------------------------*/

/**
 * @brief   IWDG clock register bits.
 */
#define STM32_IWDG_BITS                     0U

/**
 * @brief   IWDG clock point.
 */
#if (STM32_IWDG_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_IWDG_FREQ                   STM32_LSI_FREQ
  #define STM32_IWDG_CLOCK                  STM32_LSI_CLOCK
#else
  #define STM32_IWDG_FREQ                   0U
  #define STM32_IWDG_CLOCK                  0U
#endif

/*
 * Sink-specific frequency checks.
 */
#if !(!((HAL_USE_USB == TRUE) && (STM32_USB_USE_USB1 == TRUE)) ||           \
     (STM32_USB_FREQ >= STM32_USBCLK_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_USB_FREQ below minimum frequency for USB1_DRIVER"
#endif

#if !(!((HAL_USE_USB == TRUE) && (STM32_USB_USE_USB1 == TRUE)) ||           \
     (STM32_USB_FREQ <= STM32_USBCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_USB_FREQ above maximum frequency for USB1_DRIVER"
#endif
/** @} */

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#if (STM32_CFG_CLOCK_DYNAMIC == FALSE) || defined(__DOXYGEN__)
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_HSI16        ? STM32_HSI16_FREQ         :                 \
   (clkpt) == CLK_HSI48        ? STM32_HSI48_FREQ         :                 \
   (clkpt) == CLK_SHSI         ? STM32_SHSI_FREQ          :                 \
   (clkpt) == CLK_HSE          ? STM32_HSE_FREQ           :                 \
   (clkpt) == CLK_MSIS         ? STM32_MSIS_FREQ          :                 \
   (clkpt) == CLK_MSIK         ? STM32_MSIK_FREQ          :                 \
   (clkpt) == CLK_PLL1P        ? STM32_PLL1P_FREQ         :                 \
   (clkpt) == CLK_PLL1Q        ? STM32_PLL1Q_FREQ         :                 \
   (clkpt) == CLK_PLL1R        ? STM32_PLL1R_FREQ         :                 \
   (clkpt) == CLK_PLL2P        ? STM32_PLL2P_FREQ         :                 \
   (clkpt) == CLK_PLL2Q        ? STM32_PLL2Q_FREQ         :                 \
   (clkpt) == CLK_PLL2R        ? STM32_PLL2R_FREQ         :                 \
   (clkpt) == CLK_PLL3P        ? STM32_PLL3P_FREQ         :                 \
   (clkpt) == CLK_PLL3Q        ? STM32_PLL3Q_FREQ         :                 \
   (clkpt) == CLK_PLL3R        ? STM32_PLL3R_FREQ         :                 \
   (clkpt) == CLK_SYSCLK       ? STM32_SYSCLK_FREQ        :                 \
   (clkpt) == CLK_HCLK         ? STM32_HCLK_FREQ          :                 \
   (clkpt) == CLK_PCLK1        ? STM32_PCLK1_FREQ         :                 \
   (clkpt) == CLK_PCLK1TIM     ? STM32_PCLK1TIM_FREQ      :                 \
   (clkpt) == CLK_PCLK2        ? STM32_PCLK2_FREQ         :                 \
   (clkpt) == CLK_PCLK2TIM     ? STM32_PCLK2TIM_FREQ      :                 \
   (clkpt) == CLK_PCLK3        ? STM32_PCLK3_FREQ         :                 \
   (clkpt) == CLK_MCO          ? STM32_MCO_FREQ           :                 \
   0U)
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif
#ifdef __cplusplus
}
#endif

#endif /* CLOCKTREE_H */

/** @} */
